grevaillot/svd_tools/headers/ATSAMV71J21/xdmac.h
#pragma once 

/* --- XDMAC: Extensible DMA Controller ----------------------------- */

/** @defgroup xdmac_registers Extensible DMA Controller Register
@{*/

/** XDMAC_XDMAC_GTYPE Global Type Register **/
#define XDMAC_XDMAC_GTYPE			MMIO32(XDMAC_BASE + 0x00)
/** XDMAC_XDMAC_GCFG Global Configuration Register **/
#define XDMAC_XDMAC_GCFG			MMIO32(XDMAC_BASE + 0x04)
/** XDMAC_XDMAC_GWAC Global Weighted Arbiter Configuration Register **/
#define XDMAC_XDMAC_GWAC			MMIO32(XDMAC_BASE + 0x08)
/** XDMAC_XDMAC_GIE Global Interrupt Enable Register **/
#define XDMAC_XDMAC_GIE			MMIO32(XDMAC_BASE + 0x0c)
/** XDMAC_XDMAC_GID Global Interrupt Disable Register **/
#define XDMAC_XDMAC_GID			MMIO32(XDMAC_BASE + 0x10)
/** XDMAC_XDMAC_GIM Global Interrupt Mask Register **/
#define XDMAC_XDMAC_GIM			MMIO32(XDMAC_BASE + 0x14)
/** XDMAC_XDMAC_GIS Global Interrupt Status Register **/
#define XDMAC_XDMAC_GIS			MMIO32(XDMAC_BASE + 0x18)
/** XDMAC_XDMAC_GE Global Channel Enable Register **/
#define XDMAC_XDMAC_GE			MMIO32(XDMAC_BASE + 0x1c)
/** XDMAC_XDMAC_GD Global Channel Disable Register **/
#define XDMAC_XDMAC_GD			MMIO32(XDMAC_BASE + 0x20)
/** XDMAC_XDMAC_GS Global Channel Status Register **/
#define XDMAC_XDMAC_GS			MMIO32(XDMAC_BASE + 0x24)
/** XDMAC_XDMAC_GRS Global Channel Read Suspend Register **/
#define XDMAC_XDMAC_GRS			MMIO32(XDMAC_BASE + 0x28)
/** XDMAC_XDMAC_GWS Global Channel Write Suspend Register **/
#define XDMAC_XDMAC_GWS			MMIO32(XDMAC_BASE + 0x2c)
/** XDMAC_XDMAC_GRWS Global Channel Read Write Suspend Register **/
#define XDMAC_XDMAC_GRWS			MMIO32(XDMAC_BASE + 0x30)
/** XDMAC_XDMAC_GRWR Global Channel Read Write Resume Register **/
#define XDMAC_XDMAC_GRWR			MMIO32(XDMAC_BASE + 0x34)
/** XDMAC_XDMAC_GSWR Global Channel Software Request Register **/
#define XDMAC_XDMAC_GSWR			MMIO32(XDMAC_BASE + 0x38)
/** XDMAC_XDMAC_GSWS Global Channel Software Request Status Register **/
#define XDMAC_XDMAC_GSWS			MMIO32(XDMAC_BASE + 0x3c)
/** XDMAC_XDMAC_GSWF Global Channel Software Flush Request Register **/
#define XDMAC_XDMAC_GSWF			MMIO32(XDMAC_BASE + 0x40)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x50)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x54)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x58)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x5c)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x60)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x64)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x68)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x6c)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x70)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x74)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x78)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x7c)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x80)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x84)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x90)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x94)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x98)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x9c)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0xa0)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0xa4)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0xa8)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0xac)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0xb0)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0xb4)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CC			MMIO32(XDMAC_BASE + 0xb8)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0xbc)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0xc0)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0xc4)
/** XDMAC_XDMAC_CHID[2]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[2]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0xd0)
/** XDMAC_XDMAC_CHID[2]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[2]_XDMAC_CID			MMIO32(XDMAC_BASE + 0xd4)
/** XDMAC_XDMAC_CHID[2]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[2]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0xd8)
/** XDMAC_XDMAC_CHID[2]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[2]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0xdc)
/** XDMAC_XDMAC_CHID[2]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[2]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0xe0)
/** XDMAC_XDMAC_CHID[2]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[2]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0xe4)
/** XDMAC_XDMAC_CHID[2]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[2]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0xe8)
/** XDMAC_XDMAC_CHID[2]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[2]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0xec)
/** XDMAC_XDMAC_CHID[2]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[2]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0xf0)
/** XDMAC_XDMAC_CHID[2]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[2]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0xf4)
/** XDMAC_XDMAC_CHID[2]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[2]_XDMAC_CC			MMIO32(XDMAC_BASE + 0xf8)
/** XDMAC_XDMAC_CHID[2]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[2]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0xfc)
/** XDMAC_XDMAC_CHID[2]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[2]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x100)
/** XDMAC_XDMAC_CHID[2]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[2]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x104)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x110)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x114)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x118)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x11c)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x120)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x124)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x128)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x12c)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x130)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x134)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x138)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x13c)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x140)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x144)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x150)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x154)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x158)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x15c)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x160)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x164)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x168)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x16c)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x170)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x174)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x178)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x17c)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x180)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x184)
/** XDMAC_XDMAC_CHID[5]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[5]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x190)
/** XDMAC_XDMAC_CHID[5]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[5]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x194)
/** XDMAC_XDMAC_CHID[5]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[5]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x198)
/** XDMAC_XDMAC_CHID[5]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[5]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x19c)
/** XDMAC_XDMAC_CHID[5]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[5]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x1a0)
/** XDMAC_XDMAC_CHID[5]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[5]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x1a4)
/** XDMAC_XDMAC_CHID[5]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[5]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x1a8)
/** XDMAC_XDMAC_CHID[5]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[5]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x1ac)
/** XDMAC_XDMAC_CHID[5]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[5]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x1b0)
/** XDMAC_XDMAC_CHID[5]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[5]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x1b4)
/** XDMAC_XDMAC_CHID[5]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[5]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x1b8)
/** XDMAC_XDMAC_CHID[5]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[5]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x1bc)
/** XDMAC_XDMAC_CHID[5]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[5]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x1c0)
/** XDMAC_XDMAC_CHID[5]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[5]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x1c4)
/** XDMAC_XDMAC_CHID[6]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[6]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x1d0)
/** XDMAC_XDMAC_CHID[6]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[6]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x1d4)
/** XDMAC_XDMAC_CHID[6]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[6]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x1d8)
/** XDMAC_XDMAC_CHID[6]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[6]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x1dc)
/** XDMAC_XDMAC_CHID[6]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[6]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x1e0)
/** XDMAC_XDMAC_CHID[6]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[6]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x1e4)
/** XDMAC_XDMAC_CHID[6]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[6]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x1e8)
/** XDMAC_XDMAC_CHID[6]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[6]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x1ec)
/** XDMAC_XDMAC_CHID[6]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[6]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x1f0)
/** XDMAC_XDMAC_CHID[6]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[6]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x1f4)
/** XDMAC_XDMAC_CHID[6]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[6]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x1f8)
/** XDMAC_XDMAC_CHID[6]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[6]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x1fc)
/** XDMAC_XDMAC_CHID[6]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[6]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x200)
/** XDMAC_XDMAC_CHID[6]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[6]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x204)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x210)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x214)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x218)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x21c)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x220)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x224)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x228)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x22c)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x230)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x234)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x238)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x23c)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x240)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x244)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x250)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x254)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x258)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x25c)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x260)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x264)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x268)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x26c)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x270)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x274)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x278)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x27c)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x280)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x284)
/** XDMAC_XDMAC_CHID[9]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[9]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x290)
/** XDMAC_XDMAC_CHID[9]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[9]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x294)
/** XDMAC_XDMAC_CHID[9]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[9]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x298)
/** XDMAC_XDMAC_CHID[9]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[9]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x29c)
/** XDMAC_XDMAC_CHID[9]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[9]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x2a0)
/** XDMAC_XDMAC_CHID[9]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[9]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x2a4)
/** XDMAC_XDMAC_CHID[9]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[9]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x2a8)
/** XDMAC_XDMAC_CHID[9]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[9]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x2ac)
/** XDMAC_XDMAC_CHID[9]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[9]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x2b0)
/** XDMAC_XDMAC_CHID[9]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[9]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x2b4)
/** XDMAC_XDMAC_CHID[9]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[9]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x2b8)
/** XDMAC_XDMAC_CHID[9]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[9]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x2bc)
/** XDMAC_XDMAC_CHID[9]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[9]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x2c0)
/** XDMAC_XDMAC_CHID[9]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[9]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x2c4)
/** XDMAC_XDMAC_CHID[10]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[10]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x2d0)
/** XDMAC_XDMAC_CHID[10]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[10]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x2d4)
/** XDMAC_XDMAC_CHID[10]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[10]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x2d8)
/** XDMAC_XDMAC_CHID[10]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[10]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x2dc)
