grevaillot/svd_tools/headers/ATSAMV71J21/xdmac.h
/** XDMAC_XDMAC_CHID[10]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[10]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x2e0)
/** XDMAC_XDMAC_CHID[10]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[10]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x2e4)
/** XDMAC_XDMAC_CHID[10]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[10]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x2e8)
/** XDMAC_XDMAC_CHID[10]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[10]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x2ec)
/** XDMAC_XDMAC_CHID[10]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[10]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x2f0)
/** XDMAC_XDMAC_CHID[10]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[10]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x2f4)
/** XDMAC_XDMAC_CHID[10]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[10]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x2f8)
/** XDMAC_XDMAC_CHID[10]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[10]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x2fc)
/** XDMAC_XDMAC_CHID[10]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[10]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x300)
/** XDMAC_XDMAC_CHID[10]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[10]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x304)
/** XDMAC_XDMAC_CHID[11]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[11]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x310)
/** XDMAC_XDMAC_CHID[11]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[11]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x314)
/** XDMAC_XDMAC_CHID[11]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[11]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x318)
/** XDMAC_XDMAC_CHID[11]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[11]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x31c)
/** XDMAC_XDMAC_CHID[11]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[11]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x320)
/** XDMAC_XDMAC_CHID[11]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[11]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x324)
/** XDMAC_XDMAC_CHID[11]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[11]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x328)
/** XDMAC_XDMAC_CHID[11]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[11]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x32c)
/** XDMAC_XDMAC_CHID[11]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[11]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x330)
/** XDMAC_XDMAC_CHID[11]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[11]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x334)
/** XDMAC_XDMAC_CHID[11]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[11]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x338)
/** XDMAC_XDMAC_CHID[11]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[11]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x33c)
/** XDMAC_XDMAC_CHID[11]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[11]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x340)
/** XDMAC_XDMAC_CHID[11]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[11]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x344)
/** XDMAC_XDMAC_CHID[12]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[12]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x350)
/** XDMAC_XDMAC_CHID[12]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[12]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x354)
/** XDMAC_XDMAC_CHID[12]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[12]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x358)
/** XDMAC_XDMAC_CHID[12]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[12]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x35c)
/** XDMAC_XDMAC_CHID[12]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[12]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x360)
/** XDMAC_XDMAC_CHID[12]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[12]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x364)
/** XDMAC_XDMAC_CHID[12]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[12]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x368)
/** XDMAC_XDMAC_CHID[12]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[12]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x36c)
/** XDMAC_XDMAC_CHID[12]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[12]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x370)
/** XDMAC_XDMAC_CHID[12]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[12]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x374)
/** XDMAC_XDMAC_CHID[12]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[12]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x378)
/** XDMAC_XDMAC_CHID[12]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[12]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x37c)
/** XDMAC_XDMAC_CHID[12]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[12]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x380)
/** XDMAC_XDMAC_CHID[12]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[12]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x384)
/** XDMAC_XDMAC_CHID[13]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[13]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x390)
/** XDMAC_XDMAC_CHID[13]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[13]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x394)
/** XDMAC_XDMAC_CHID[13]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[13]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x398)
/** XDMAC_XDMAC_CHID[13]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[13]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x39c)
/** XDMAC_XDMAC_CHID[13]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[13]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x3a0)
/** XDMAC_XDMAC_CHID[13]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[13]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x3a4)
/** XDMAC_XDMAC_CHID[13]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[13]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x3a8)
/** XDMAC_XDMAC_CHID[13]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[13]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x3ac)
/** XDMAC_XDMAC_CHID[13]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[13]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x3b0)
/** XDMAC_XDMAC_CHID[13]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[13]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x3b4)
/** XDMAC_XDMAC_CHID[13]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[13]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x3b8)
/** XDMAC_XDMAC_CHID[13]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[13]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x3bc)
/** XDMAC_XDMAC_CHID[13]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[13]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x3c0)
/** XDMAC_XDMAC_CHID[13]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[13]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x3c4)
/** XDMAC_XDMAC_CHID[14]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[14]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x3d0)
/** XDMAC_XDMAC_CHID[14]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[14]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x3d4)
/** XDMAC_XDMAC_CHID[14]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[14]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x3d8)
/** XDMAC_XDMAC_CHID[14]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[14]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x3dc)
/** XDMAC_XDMAC_CHID[14]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[14]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x3e0)
/** XDMAC_XDMAC_CHID[14]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[14]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x3e4)
/** XDMAC_XDMAC_CHID[14]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[14]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x3e8)
/** XDMAC_XDMAC_CHID[14]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[14]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x3ec)
/** XDMAC_XDMAC_CHID[14]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[14]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x3f0)
/** XDMAC_XDMAC_CHID[14]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[14]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x3f4)
/** XDMAC_XDMAC_CHID[14]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[14]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x3f8)
/** XDMAC_XDMAC_CHID[14]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[14]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x3fc)
/** XDMAC_XDMAC_CHID[14]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[14]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x400)
/** XDMAC_XDMAC_CHID[14]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[14]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x404)
/** XDMAC_XDMAC_CHID[15]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[15]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x410)
/** XDMAC_XDMAC_CHID[15]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[15]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x414)
/** XDMAC_XDMAC_CHID[15]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[15]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x418)
/** XDMAC_XDMAC_CHID[15]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[15]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x41c)
/** XDMAC_XDMAC_CHID[15]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[15]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x420)
/** XDMAC_XDMAC_CHID[15]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[15]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x424)
/** XDMAC_XDMAC_CHID[15]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[15]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x428)
/** XDMAC_XDMAC_CHID[15]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[15]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x42c)
/** XDMAC_XDMAC_CHID[15]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[15]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x430)
/** XDMAC_XDMAC_CHID[15]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[15]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x434)
/** XDMAC_XDMAC_CHID[15]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[15]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x438)
/** XDMAC_XDMAC_CHID[15]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[15]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x43c)
/** XDMAC_XDMAC_CHID[15]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[15]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x440)
/** XDMAC_XDMAC_CHID[15]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[15]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x444)
/** XDMAC_XDMAC_CHID[16]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[16]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x450)
/** XDMAC_XDMAC_CHID[16]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[16]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x454)
/** XDMAC_XDMAC_CHID[16]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[16]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x458)
/** XDMAC_XDMAC_CHID[16]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[16]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x45c)
/** XDMAC_XDMAC_CHID[16]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[16]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x460)
/** XDMAC_XDMAC_CHID[16]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[16]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x464)
/** XDMAC_XDMAC_CHID[16]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[16]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x468)
/** XDMAC_XDMAC_CHID[16]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[16]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x46c)
/** XDMAC_XDMAC_CHID[16]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[16]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x470)
/** XDMAC_XDMAC_CHID[16]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[16]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x474)
/** XDMAC_XDMAC_CHID[16]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[16]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x478)
/** XDMAC_XDMAC_CHID[16]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[16]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x47c)
/** XDMAC_XDMAC_CHID[16]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[16]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x480)
/** XDMAC_XDMAC_CHID[16]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[16]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x484)
/** XDMAC_XDMAC_CHID[17]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[17]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x490)
/** XDMAC_XDMAC_CHID[17]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[17]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x494)
/** XDMAC_XDMAC_CHID[17]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[17]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x498)
/** XDMAC_XDMAC_CHID[17]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[17]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x49c)
/** XDMAC_XDMAC_CHID[17]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[17]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x4a0)
/** XDMAC_XDMAC_CHID[17]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[17]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x4a4)
/** XDMAC_XDMAC_CHID[17]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[17]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x4a8)
/** XDMAC_XDMAC_CHID[17]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[17]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x4ac)
/** XDMAC_XDMAC_CHID[17]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[17]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x4b0)
/** XDMAC_XDMAC_CHID[17]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[17]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x4b4)
/** XDMAC_XDMAC_CHID[17]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[17]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x4b8)
/** XDMAC_XDMAC_CHID[17]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[17]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x4bc)
/** XDMAC_XDMAC_CHID[17]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[17]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x4c0)
/** XDMAC_XDMAC_CHID[17]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[17]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x4c4)
/** XDMAC_XDMAC_CHID[18]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[18]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x4d0)
/** XDMAC_XDMAC_CHID[18]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[18]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x4d4)
/** XDMAC_XDMAC_CHID[18]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[18]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x4d8)
/** XDMAC_XDMAC_CHID[18]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[18]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x4dc)
/** XDMAC_XDMAC_CHID[18]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[18]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x4e0)
/** XDMAC_XDMAC_CHID[18]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[18]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x4e4)
/** XDMAC_XDMAC_CHID[18]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[18]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x4e8)
/** XDMAC_XDMAC_CHID[18]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[18]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x4ec)
/** XDMAC_XDMAC_CHID[18]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[18]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x4f0)
/** XDMAC_XDMAC_CHID[18]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[18]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x4f4)
/** XDMAC_XDMAC_CHID[18]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[18]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x4f8)
/** XDMAC_XDMAC_CHID[18]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[18]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x4fc)
/** XDMAC_XDMAC_CHID[18]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[18]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x500)
/** XDMAC_XDMAC_CHID[18]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[18]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x504)
/** XDMAC_XDMAC_CHID[19]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[19]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x510)
/** XDMAC_XDMAC_CHID[19]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[19]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x514)
/** XDMAC_XDMAC_CHID[19]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[19]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x518)
/** XDMAC_XDMAC_CHID[19]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[19]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x51c)
/** XDMAC_XDMAC_CHID[19]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[19]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x520)
/** XDMAC_XDMAC_CHID[19]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[19]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x524)
/** XDMAC_XDMAC_CHID[19]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[19]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x528)
/** XDMAC_XDMAC_CHID[19]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[19]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x52c)
/** XDMAC_XDMAC_CHID[19]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[19]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x530)
/** XDMAC_XDMAC_CHID[19]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[19]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x534)
/** XDMAC_XDMAC_CHID[19]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[19]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x538)
/** XDMAC_XDMAC_CHID[19]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[19]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x53c)
/** XDMAC_XDMAC_CHID[19]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[19]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x540)
/** XDMAC_XDMAC_CHID[19]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[19]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x544)
/** XDMAC_XDMAC_CHID[20]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[20]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x550)
/** XDMAC_XDMAC_CHID[20]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[20]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x554)
/** XDMAC_XDMAC_CHID[20]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[20]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x558)
/** XDMAC_XDMAC_CHID[20]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[20]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x55c)
/** XDMAC_XDMAC_CHID[20]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[20]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x560)
/** XDMAC_XDMAC_CHID[20]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[20]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x564)
/** XDMAC_XDMAC_CHID[20]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[20]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x568)
/** XDMAC_XDMAC_CHID[20]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[20]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x56c)
/** XDMAC_XDMAC_CHID[20]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[20]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x570)
/** XDMAC_XDMAC_CHID[20]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[20]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x574)
/** XDMAC_XDMAC_CHID[20]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[20]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x578)
/** XDMAC_XDMAC_CHID[20]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[20]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x57c)
/** XDMAC_XDMAC_CHID[20]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[20]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x580)
/** XDMAC_XDMAC_CHID[20]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[20]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x584)
/** XDMAC_XDMAC_CHID[21]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[21]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x590)
/** XDMAC_XDMAC_CHID[21]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[21]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x594)
/** XDMAC_XDMAC_CHID[21]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[21]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x598)
/** XDMAC_XDMAC_CHID[21]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[21]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x59c)
/** XDMAC_XDMAC_CHID[21]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[21]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x5a0)
