grevaillot/svd_tools/headers/ATSAMV71J21/xdmac.h
/** XDMAC_XDMAC_CHID[21]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[21]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x5a4)
/** XDMAC_XDMAC_CHID[21]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[21]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x5a8)
/** XDMAC_XDMAC_CHID[21]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[21]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x5ac)
/** XDMAC_XDMAC_CHID[21]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[21]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x5b0)
/** XDMAC_XDMAC_CHID[21]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[21]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x5b4)
/** XDMAC_XDMAC_CHID[21]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[21]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x5b8)
/** XDMAC_XDMAC_CHID[21]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[21]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x5bc)
/** XDMAC_XDMAC_CHID[21]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[21]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x5c0)
/** XDMAC_XDMAC_CHID[21]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[21]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x5c4)
/** XDMAC_XDMAC_CHID[22]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[22]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x5d0)
/** XDMAC_XDMAC_CHID[22]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[22]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x5d4)
/** XDMAC_XDMAC_CHID[22]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[22]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x5d8)
/** XDMAC_XDMAC_CHID[22]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[22]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x5dc)
/** XDMAC_XDMAC_CHID[22]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[22]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x5e0)
/** XDMAC_XDMAC_CHID[22]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[22]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x5e4)
/** XDMAC_XDMAC_CHID[22]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[22]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x5e8)
/** XDMAC_XDMAC_CHID[22]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[22]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x5ec)
/** XDMAC_XDMAC_CHID[22]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[22]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x5f0)
/** XDMAC_XDMAC_CHID[22]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[22]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x5f4)
/** XDMAC_XDMAC_CHID[22]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[22]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x5f8)
/** XDMAC_XDMAC_CHID[22]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[22]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x5fc)
/** XDMAC_XDMAC_CHID[22]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[22]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x600)
/** XDMAC_XDMAC_CHID[22]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[22]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x604)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CIE Channel Interrupt Enable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x610)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CID Channel Interrupt Disable Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x614)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CIM Channel Interrupt Mask Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x618)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CIS Channel Interrupt Status Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x61c)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CSA Channel Source Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x620)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CDA Channel Destination Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x624)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CNDA Channel Next Descriptor Address Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x628)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CNDC Channel Next Descriptor Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x62c)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CUBC Channel Microblock Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x630)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CBC Channel Block Control Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x634)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CC Channel Configuration Register (chid = 0) **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x638)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern (chid = 0) **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x63c)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CSUS Channel Source Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x640)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CDUS Channel Destination Microblock Stride (chid = 0) **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x644)
/** XDMAC_XDMAC_VERSION XDMAC Version Register **/
#define XDMAC_XDMAC_VERSION			MMIO32(XDMAC_BASE + 0xffc)

/**@}*/


/** @defgroup xdmac_xdmac_gtype XDMACGTYPE Global Type Register
@{*/


#define XDMAC_XDMAC_GTYPE_NB_REQ_SHIFT		16
#define XDMAC_XDMAC_GTYPE_NB_REQ_MASK		0x7f
/** @defgroup xdmac_xdmac_gtype_nb_req NBREQ Number of Peripheral Requests Minus One
@{*/
/**@}*/


