grevaillot/svd_tools/headers/ATSAMV71J21/xdmac.h
/** XDMAC_XDMAC_GWS_WS23 XDMAC Channel 23 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS23		(1 << 23)
/** XDMAC_XDMAC_GWS_WS22 XDMAC Channel 22 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS22		(1 << 22)
/** XDMAC_XDMAC_GWS_WS21 XDMAC Channel 21 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS21		(1 << 21)
/** XDMAC_XDMAC_GWS_WS20 XDMAC Channel 20 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS20		(1 << 20)
/** XDMAC_XDMAC_GWS_WS19 XDMAC Channel 19 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS19		(1 << 19)
/** XDMAC_XDMAC_GWS_WS18 XDMAC Channel 18 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS18		(1 << 18)
/** XDMAC_XDMAC_GWS_WS17 XDMAC Channel 17 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS17		(1 << 17)
/** XDMAC_XDMAC_GWS_WS16 XDMAC Channel 16 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS16		(1 << 16)
/** XDMAC_XDMAC_GWS_WS15 XDMAC Channel 15 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS15		(1 << 15)
/** XDMAC_XDMAC_GWS_WS14 XDMAC Channel 14 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS14		(1 << 14)
/** XDMAC_XDMAC_GWS_WS13 XDMAC Channel 13 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS13		(1 << 13)
/** XDMAC_XDMAC_GWS_WS12 XDMAC Channel 12 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS12		(1 << 12)
/** XDMAC_XDMAC_GWS_WS11 XDMAC Channel 11 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS11		(1 << 11)
/** XDMAC_XDMAC_GWS_WS10 XDMAC Channel 10 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS10		(1 << 10)
/** XDMAC_XDMAC_GWS_WS9 XDMAC Channel 9 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS9		(1 << 9)
/** XDMAC_XDMAC_GWS_WS8 XDMAC Channel 8 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS8		(1 << 8)
/** XDMAC_XDMAC_GWS_WS7 XDMAC Channel 7 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS7		(1 << 7)
/** XDMAC_XDMAC_GWS_WS6 XDMAC Channel 6 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS6		(1 << 6)
/** XDMAC_XDMAC_GWS_WS5 XDMAC Channel 5 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS5		(1 << 5)
/** XDMAC_XDMAC_GWS_WS4 XDMAC Channel 4 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS4		(1 << 4)
/** XDMAC_XDMAC_GWS_WS3 XDMAC Channel 3 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS3		(1 << 3)
/** XDMAC_XDMAC_GWS_WS2 XDMAC Channel 2 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS2		(1 << 2)
/** XDMAC_XDMAC_GWS_WS1 XDMAC Channel 1 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS1		(1 << 1)
/** XDMAC_XDMAC_GWS_WS0 XDMAC Channel 0 Write Suspend Bit **/
#define XDMAC_XDMAC_GWS_WS0		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_grws XDMACGRWS Global Channel Read Write Suspend Register
@{*/

/** XDMAC_XDMAC_GRWS_RWS23 XDMAC Channel 23 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS23		(1 << 23)
/** XDMAC_XDMAC_GRWS_RWS22 XDMAC Channel 22 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS22		(1 << 22)
/** XDMAC_XDMAC_GRWS_RWS21 XDMAC Channel 21 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS21		(1 << 21)
/** XDMAC_XDMAC_GRWS_RWS20 XDMAC Channel 20 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS20		(1 << 20)
/** XDMAC_XDMAC_GRWS_RWS19 XDMAC Channel 19 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS19		(1 << 19)
/** XDMAC_XDMAC_GRWS_RWS18 XDMAC Channel 18 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS18		(1 << 18)
/** XDMAC_XDMAC_GRWS_RWS17 XDMAC Channel 17 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS17		(1 << 17)
/** XDMAC_XDMAC_GRWS_RWS16 XDMAC Channel 16 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS16		(1 << 16)
/** XDMAC_XDMAC_GRWS_RWS15 XDMAC Channel 15 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS15		(1 << 15)
/** XDMAC_XDMAC_GRWS_RWS14 XDMAC Channel 14 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS14		(1 << 14)
/** XDMAC_XDMAC_GRWS_RWS13 XDMAC Channel 13 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS13		(1 << 13)
/** XDMAC_XDMAC_GRWS_RWS12 XDMAC Channel 12 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS12		(1 << 12)
/** XDMAC_XDMAC_GRWS_RWS11 XDMAC Channel 11 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS11		(1 << 11)
/** XDMAC_XDMAC_GRWS_RWS10 XDMAC Channel 10 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS10		(1 << 10)
/** XDMAC_XDMAC_GRWS_RWS9 XDMAC Channel 9 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS9		(1 << 9)
/** XDMAC_XDMAC_GRWS_RWS8 XDMAC Channel 8 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS8		(1 << 8)
/** XDMAC_XDMAC_GRWS_RWS7 XDMAC Channel 7 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS7		(1 << 7)
/** XDMAC_XDMAC_GRWS_RWS6 XDMAC Channel 6 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS6		(1 << 6)
/** XDMAC_XDMAC_GRWS_RWS5 XDMAC Channel 5 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS5		(1 << 5)
/** XDMAC_XDMAC_GRWS_RWS4 XDMAC Channel 4 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS4		(1 << 4)
/** XDMAC_XDMAC_GRWS_RWS3 XDMAC Channel 3 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS3		(1 << 3)
/** XDMAC_XDMAC_GRWS_RWS2 XDMAC Channel 2 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS2		(1 << 2)
/** XDMAC_XDMAC_GRWS_RWS1 XDMAC Channel 1 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS1		(1 << 1)
/** XDMAC_XDMAC_GRWS_RWS0 XDMAC Channel 0 Read Write Suspend Bit **/
#define XDMAC_XDMAC_GRWS_RWS0		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_grwr XDMACGRWR Global Channel Read Write Resume Register
@{*/

/** XDMAC_XDMAC_GRWR_RWR23 XDMAC Channel 23 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR23		(1 << 23)
/** XDMAC_XDMAC_GRWR_RWR22 XDMAC Channel 22 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR22		(1 << 22)
/** XDMAC_XDMAC_GRWR_RWR21 XDMAC Channel 21 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR21		(1 << 21)
/** XDMAC_XDMAC_GRWR_RWR20 XDMAC Channel 20 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR20		(1 << 20)
/** XDMAC_XDMAC_GRWR_RWR19 XDMAC Channel 19 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR19		(1 << 19)
/** XDMAC_XDMAC_GRWR_RWR18 XDMAC Channel 18 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR18		(1 << 18)
/** XDMAC_XDMAC_GRWR_RWR17 XDMAC Channel 17 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR17		(1 << 17)
/** XDMAC_XDMAC_GRWR_RWR16 XDMAC Channel 16 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR16		(1 << 16)
/** XDMAC_XDMAC_GRWR_RWR15 XDMAC Channel 15 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR15		(1 << 15)
/** XDMAC_XDMAC_GRWR_RWR14 XDMAC Channel 14 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR14		(1 << 14)
/** XDMAC_XDMAC_GRWR_RWR13 XDMAC Channel 13 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR13		(1 << 13)
/** XDMAC_XDMAC_GRWR_RWR12 XDMAC Channel 12 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR12		(1 << 12)
/** XDMAC_XDMAC_GRWR_RWR11 XDMAC Channel 11 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR11		(1 << 11)
/** XDMAC_XDMAC_GRWR_RWR10 XDMAC Channel 10 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR10		(1 << 10)
/** XDMAC_XDMAC_GRWR_RWR9 XDMAC Channel 9 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR9		(1 << 9)
/** XDMAC_XDMAC_GRWR_RWR8 XDMAC Channel 8 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR8		(1 << 8)
/** XDMAC_XDMAC_GRWR_RWR7 XDMAC Channel 7 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR7		(1 << 7)
/** XDMAC_XDMAC_GRWR_RWR6 XDMAC Channel 6 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR6		(1 << 6)
/** XDMAC_XDMAC_GRWR_RWR5 XDMAC Channel 5 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR5		(1 << 5)
/** XDMAC_XDMAC_GRWR_RWR4 XDMAC Channel 4 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR4		(1 << 4)
/** XDMAC_XDMAC_GRWR_RWR3 XDMAC Channel 3 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR3		(1 << 3)
/** XDMAC_XDMAC_GRWR_RWR2 XDMAC Channel 2 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR2		(1 << 2)
/** XDMAC_XDMAC_GRWR_RWR1 XDMAC Channel 1 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR1		(1 << 1)
/** XDMAC_XDMAC_GRWR_RWR0 XDMAC Channel 0 Read Write Resume Bit **/
#define XDMAC_XDMAC_GRWR_RWR0		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_gswr XDMACGSWR Global Channel Software Request Register
@{*/

/** XDMAC_XDMAC_GSWR_SWREQ23 XDMAC Channel 23 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ23		(1 << 23)
/** XDMAC_XDMAC_GSWR_SWREQ22 XDMAC Channel 22 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ22		(1 << 22)
/** XDMAC_XDMAC_GSWR_SWREQ21 XDMAC Channel 21 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ21		(1 << 21)
/** XDMAC_XDMAC_GSWR_SWREQ20 XDMAC Channel 20 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ20		(1 << 20)
/** XDMAC_XDMAC_GSWR_SWREQ19 XDMAC Channel 19 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ19		(1 << 19)
/** XDMAC_XDMAC_GSWR_SWREQ18 XDMAC Channel 18 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ18		(1 << 18)
/** XDMAC_XDMAC_GSWR_SWREQ17 XDMAC Channel 17 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ17		(1 << 17)
/** XDMAC_XDMAC_GSWR_SWREQ16 XDMAC Channel 16 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ16		(1 << 16)
/** XDMAC_XDMAC_GSWR_SWREQ15 XDMAC Channel 15 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ15		(1 << 15)
/** XDMAC_XDMAC_GSWR_SWREQ14 XDMAC Channel 14 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ14		(1 << 14)
/** XDMAC_XDMAC_GSWR_SWREQ13 XDMAC Channel 13 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ13		(1 << 13)
/** XDMAC_XDMAC_GSWR_SWREQ12 XDMAC Channel 12 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ12		(1 << 12)
/** XDMAC_XDMAC_GSWR_SWREQ11 XDMAC Channel 11 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ11		(1 << 11)
/** XDMAC_XDMAC_GSWR_SWREQ10 XDMAC Channel 10 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ10		(1 << 10)
/** XDMAC_XDMAC_GSWR_SWREQ9 XDMAC Channel 9 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ9		(1 << 9)
/** XDMAC_XDMAC_GSWR_SWREQ8 XDMAC Channel 8 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ8		(1 << 8)
/** XDMAC_XDMAC_GSWR_SWREQ7 XDMAC Channel 7 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ7		(1 << 7)
/** XDMAC_XDMAC_GSWR_SWREQ6 XDMAC Channel 6 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ6		(1 << 6)
/** XDMAC_XDMAC_GSWR_SWREQ5 XDMAC Channel 5 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ5		(1 << 5)
/** XDMAC_XDMAC_GSWR_SWREQ4 XDMAC Channel 4 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ4		(1 << 4)
/** XDMAC_XDMAC_GSWR_SWREQ3 XDMAC Channel 3 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ3		(1 << 3)
/** XDMAC_XDMAC_GSWR_SWREQ2 XDMAC Channel 2 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ2		(1 << 2)
/** XDMAC_XDMAC_GSWR_SWREQ1 XDMAC Channel 1 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ1		(1 << 1)
/** XDMAC_XDMAC_GSWR_SWREQ0 XDMAC Channel 0 Software Request Bit **/
#define XDMAC_XDMAC_GSWR_SWREQ0		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_gsws XDMACGSWS Global Channel Software Request Status Register
@{*/

