grevaillot/svd_tools/headers/ATSAMV71J21/xdmac.h
#define XDMAC_XDMAC_CHID[0]_XDMAC_CC_DAM_SHIFT		18
#define XDMAC_XDMAC_CHID[0]_XDMAC_CC_DAM_MASK		0x03
/** @defgroup xdmac_xdmac_chid[0]_xdmac_cc_dam DAM Channel x Destination Addressing Mode
@{*/
/**@}*/


#define XDMAC_XDMAC_CHID[0]_XDMAC_CC_SAM_SHIFT		16
#define XDMAC_XDMAC_CHID[0]_XDMAC_CC_SAM_MASK		0x03
/** @defgroup xdmac_xdmac_chid[0]_xdmac_cc_sam SAM Channel x Source Addressing Mode
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[0]_XDMAC_CC_DIF Channel x Destination Interface Identifier **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CC_DIF		(1 << 14)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CC_SIF Channel x Source Interface Identifier **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CC_SIF		(1 << 13)

#define XDMAC_XDMAC_CHID[0]_XDMAC_CC_DWIDTH_SHIFT		11
#define XDMAC_XDMAC_CHID[0]_XDMAC_CC_DWIDTH_MASK		0x03
/** @defgroup xdmac_xdmac_chid[0]_xdmac_cc_dwidth DWIDTH Channel x Data Width
@{*/
/**@}*/


#define XDMAC_XDMAC_CHID[0]_XDMAC_CC_CSIZE_SHIFT		8
#define XDMAC_XDMAC_CHID[0]_XDMAC_CC_CSIZE_MASK		0x07
/** @defgroup xdmac_xdmac_chid[0]_xdmac_cc_csize CSIZE Channel x Chunk Size
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[0]_XDMAC_CC_MEMSET Channel x Fill Block of Memory **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CC_MEMSET		(1 << 7)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CC_SWREQ Channel x Software Request Trigger **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CC_SWREQ		(1 << 6)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CC_DSYNC Channel x Synchronization **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CC_DSYNC		(1 << 4)

#define XDMAC_XDMAC_CHID[0]_XDMAC_CC_MBSIZE_SHIFT		1
#define XDMAC_XDMAC_CHID[0]_XDMAC_CC_MBSIZE_MASK		0x03
/** @defgroup xdmac_xdmac_chid[0]_xdmac_cc_mbsize MBSIZE Channel x Memory Burst Size
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[0]_XDMAC_CC_TYPE Channel x Transfer Type **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CC_TYPE		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[0]_xdmac_cds_msp XDMACCHID[0]XDMACCDSMSP Channel Data Stride Memory Set Pattern (chid = 0)
@{*/


#define XDMAC_XDMAC_CHID[0]_XDMAC_CDS_MSP_DDS_MSP_SHIFT		16
#define XDMAC_XDMAC_CHID[0]_XDMAC_CDS_MSP_DDS_MSP_MASK		0xffff
/** @defgroup xdmac_xdmac_chid[0]_xdmac_cds_msp_dds_msp DDSMSP Channel x Destination Data Stride or Memory Set Pattern
@{*/
/**@}*/


#define XDMAC_XDMAC_CHID[0]_XDMAC_CDS_MSP_SDS_MSP_SHIFT		0
#define XDMAC_XDMAC_CHID[0]_XDMAC_CDS_MSP_SDS_MSP_MASK		0xffff
/** @defgroup xdmac_xdmac_chid[0]_xdmac_cds_msp_sds_msp SDSMSP Channel x Source Data stride or Memory Set Pattern
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[0]_xdmac_csus XDMACCHID[0]XDMACCSUS Channel Source Microblock Stride (chid = 0)
@{*/


#define XDMAC_XDMAC_CHID[0]_XDMAC_CSUS_SUBS_SHIFT		0
#define XDMAC_XDMAC_CHID[0]_XDMAC_CSUS_SUBS_MASK		0xffffff
/** @defgroup xdmac_xdmac_chid[0]_xdmac_csus_subs SUBS Channel x Source Microblock Stride
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[0]_xdmac_cdus XDMACCHID[0]XDMACCDUS Channel Destination Microblock Stride (chid = 0)
@{*/


#define XDMAC_XDMAC_CHID[0]_XDMAC_CDUS_DUBS_SHIFT		0
#define XDMAC_XDMAC_CHID[0]_XDMAC_CDUS_DUBS_MASK		0xffffff
/** @defgroup xdmac_xdmac_chid[0]_xdmac_cdus_dubs DUBS Channel x Destination Microblock Stride
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[1]_xdmac_cie XDMACCHID[1]XDMACCIE Channel Interrupt Enable Register (chid = 0)
@{*/

/** XDMAC_XDMAC_CHID[1]_XDMAC_CIE_ROIE Request Overflow Error Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CIE_ROIE		(1 << 6)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CIE_WBIE Write Bus Error Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CIE_WBIE		(1 << 5)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CIE_RBIE Read Bus Error Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CIE_RBIE		(1 << 4)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CIE_FIE End of Flush Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CIE_FIE		(1 << 3)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CIE_DIE End of Disable Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CIE_DIE		(1 << 2)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CIE_LIE End of Linked List Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CIE_LIE		(1 << 1)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CIE_BIE End of Block Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CIE_BIE		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[1]_xdmac_cid XDMACCHID[1]XDMACCID Channel Interrupt Disable Register (chid = 0)
@{*/

/** XDMAC_XDMAC_CHID[1]_XDMAC_CID_ROID Request Overflow Error Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CID_ROID		(1 << 6)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CID_WBEID Write Bus Error Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CID_WBEID		(1 << 5)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CID_RBEID Read Bus Error Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CID_RBEID		(1 << 4)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CID_FID End of Flush Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CID_FID		(1 << 3)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CID_DID End of Disable Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CID_DID		(1 << 2)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CID_LID End of Linked List Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CID_LID		(1 << 1)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CID_BID End of Block Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CID_BID		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[1]_xdmac_cim XDMACCHID[1]XDMACCIM Channel Interrupt Mask Register (chid = 0)
@{*/

/** XDMAC_XDMAC_CHID[1]_XDMAC_CIM_ROIM Request Overflow Error Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CIM_ROIM		(1 << 6)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CIM_WBEIM Write Bus Error Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CIM_WBEIM		(1 << 5)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CIM_RBEIM Read Bus Error Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CIM_RBEIM		(1 << 4)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CIM_FIM End of Flush Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CIM_FIM		(1 << 3)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CIM_DIM End of Disable Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CIM_DIM		(1 << 2)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CIM_LIM End of Linked List Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CIM_LIM		(1 << 1)
/** XDMAC_XDMAC_CHID[1]_XDMAC_CIM_BIM End of Block Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[1]_XDMAC_CIM_BIM		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[1]_xdmac_cis XDMACCHID[1]XDMACCIS Channel Interrupt Status Register (chid = 0)
@{*/

