grevaillot/svd_tools/headers/ATSAMV71J21/xdmac.h
#define XDMAC_XDMAC_CHID[3]_XDMAC_CSA_SA_SHIFT		0
#define XDMAC_XDMAC_CHID[3]_XDMAC_CSA_SA_MASK		0xffffffff
/** @defgroup xdmac_xdmac_chid[3]_xdmac_csa_sa SA Channel x Source Address
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[3]_xdmac_cda XDMACCHID[3]XDMACCDA Channel Destination Address Register (chid = 0)
@{*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CDA_DA_SHIFT		0
#define XDMAC_XDMAC_CHID[3]_XDMAC_CDA_DA_MASK		0xffffffff
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cda_da DA Channel x Destination Address
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[3]_xdmac_cnda XDMACCHID[3]XDMACCNDA Channel Next Descriptor Address Register (chid = 0)
@{*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CNDA_NDA_SHIFT		2
#define XDMAC_XDMAC_CHID[3]_XDMAC_CNDA_NDA_MASK		0x3fffffff
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cnda_nda NDA Channel x Next Descriptor Address
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[3]_XDMAC_CNDA_NDAIF Channel x Next Descriptor Interface **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CNDA_NDAIF		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[3]_xdmac_cndc XDMACCHID[3]XDMACCNDC Channel Next Descriptor Control Register (chid = 0)
@{*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CNDC_NDVIEW_SHIFT		3
#define XDMAC_XDMAC_CHID[3]_XDMAC_CNDC_NDVIEW_MASK		0x03
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cndc_ndview NDVIEW Channel x Next Descriptor View
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[3]_XDMAC_CNDC_NDDUP Channel x Next Descriptor Destination Update **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CNDC_NDDUP		(1 << 2)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CNDC_NDSUP Channel x Next Descriptor Source Update **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CNDC_NDSUP		(1 << 1)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CNDC_NDE Channel x Next Descriptor Enable **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CNDC_NDE		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[3]_xdmac_cubc XDMACCHID[3]XDMACCUBC Channel Microblock Control Register (chid = 0)
@{*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CUBC_UBLEN_SHIFT		0
#define XDMAC_XDMAC_CHID[3]_XDMAC_CUBC_UBLEN_MASK		0xffffff
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cubc_ublen UBLEN Channel x Microblock Length
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[3]_xdmac_cbc XDMACCHID[3]XDMACCBC Channel Block Control Register (chid = 0)
@{*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CBC_BLEN_SHIFT		0
#define XDMAC_XDMAC_CHID[3]_XDMAC_CBC_BLEN_MASK		0xfff
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cbc_blen BLEN Channel x Block Length
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[3]_xdmac_cc XDMACCHID[3]XDMACCC Channel Configuration Register (chid = 0)
@{*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_PERID_SHIFT		24
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_PERID_MASK		0x7f
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cc_perid PERID Channel x Peripheral Hardware Request Line Identifier
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[3]_XDMAC_CC_WRIP Write in Progress (this bit is read-only) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_WRIP		(1 << 23)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CC_RDIP Read in Progress (this bit is read-only) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_RDIP		(1 << 22)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CC_INITD Channel Initialization Done (this bit is read-only) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_INITD		(1 << 21)

#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_DAM_SHIFT		18
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_DAM_MASK		0x03
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cc_dam DAM Channel x Destination Addressing Mode
@{*/
/**@}*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_SAM_SHIFT		16
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_SAM_MASK		0x03
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cc_sam SAM Channel x Source Addressing Mode
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[3]_XDMAC_CC_DIF Channel x Destination Interface Identifier **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_DIF		(1 << 14)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CC_SIF Channel x Source Interface Identifier **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_SIF		(1 << 13)

#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_DWIDTH_SHIFT		11
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_DWIDTH_MASK		0x03
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cc_dwidth DWIDTH Channel x Data Width
@{*/
/**@}*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_CSIZE_SHIFT		8
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_CSIZE_MASK		0x07
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cc_csize CSIZE Channel x Chunk Size
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[3]_XDMAC_CC_MEMSET Channel x Fill Block of Memory **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_MEMSET		(1 << 7)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CC_SWREQ Channel x Software Request Trigger **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_SWREQ		(1 << 6)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CC_DSYNC Channel x Synchronization **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_DSYNC		(1 << 4)

#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_MBSIZE_SHIFT		1
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_MBSIZE_MASK		0x03
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cc_mbsize MBSIZE Channel x Memory Burst Size
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[3]_XDMAC_CC_TYPE Channel x Transfer Type **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_TYPE		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[3]_xdmac_cds_msp XDMACCHID[3]XDMACCDSMSP Channel Data Stride Memory Set Pattern (chid = 0)
@{*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CDS_MSP_DDS_MSP_SHIFT		16
#define XDMAC_XDMAC_CHID[3]_XDMAC_CDS_MSP_DDS_MSP_MASK		0xffff
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cds_msp_dds_msp DDSMSP Channel x Destination Data Stride or Memory Set Pattern
@{*/
/**@}*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CDS_MSP_SDS_MSP_SHIFT		0
#define XDMAC_XDMAC_CHID[3]_XDMAC_CDS_MSP_SDS_MSP_MASK		0xffff
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cds_msp_sds_msp SDSMSP Channel x Source Data stride or Memory Set Pattern
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[3]_xdmac_csus XDMACCHID[3]XDMACCSUS Channel Source Microblock Stride (chid = 0)
@{*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CSUS_SUBS_SHIFT		0
#define XDMAC_XDMAC_CHID[3]_XDMAC_CSUS_SUBS_MASK		0xffffff
/** @defgroup xdmac_xdmac_chid[3]_xdmac_csus_subs SUBS Channel x Source Microblock Stride
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[3]_xdmac_cdus XDMACCHID[3]XDMACCDUS Channel Destination Microblock Stride (chid = 0)
@{*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CDUS_DUBS_SHIFT		0
#define XDMAC_XDMAC_CHID[3]_XDMAC_CDUS_DUBS_MASK		0xffffff
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cdus_dubs DUBS Channel x Destination Microblock Stride
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[4]_xdmac_cie XDMACCHID[4]XDMACCIE Channel Interrupt Enable Register (chid = 0)
@{*/

/** XDMAC_XDMAC_CHID[4]_XDMAC_CIE_ROIE Request Overflow Error Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CIE_ROIE		(1 << 6)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CIE_WBIE Write Bus Error Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CIE_WBIE		(1 << 5)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CIE_RBIE Read Bus Error Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CIE_RBIE		(1 << 4)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CIE_FIE End of Flush Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CIE_FIE		(1 << 3)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CIE_DIE End of Disable Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CIE_DIE		(1 << 2)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CIE_LIE End of Linked List Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CIE_LIE		(1 << 1)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CIE_BIE End of Block Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CIE_BIE		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[4]_xdmac_cid XDMACCHID[4]XDMACCID Channel Interrupt Disable Register (chid = 0)
@{*/

/** XDMAC_XDMAC_CHID[4]_XDMAC_CID_ROID Request Overflow Error Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CID_ROID		(1 << 6)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CID_WBEID Write Bus Error Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CID_WBEID		(1 << 5)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CID_RBEID Read Bus Error Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CID_RBEID		(1 << 4)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CID_FID End of Flush Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CID_FID		(1 << 3)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CID_DID End of Disable Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CID_DID		(1 << 2)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CID_LID End of Linked List Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CID_LID		(1 << 1)
/** XDMAC_XDMAC_CHID[4]_XDMAC_CID_BID End of Block Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[4]_XDMAC_CID_BID		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[4]_xdmac_cim XDMACCHID[4]XDMACCIM Channel Interrupt Mask Register (chid = 0)
@{*/

